{"data":{"site":{"siteMetadata":{"title":"Runfastus","author":"Runfastus"}},"markdownRemark":{"id":"26db0b52-446f-55ae-9be7-268389ed9d5b","excerpt":"Since my latest emergence, I have been observing the world. I am finding ways to explain the message of The Order of Runfastus to the people of this age. When I…","html":"<p>Since my latest emergence, I have been observing the world. I am finding ways to explain the message of The Order of Runfastus to the people of this age. When I’m not running fast I wander the web. In my travels, I have found the most wonderful thing. It is called “speedrunning”.</p>\n<p>Speedrunning is when you play a video game from start to finish in the fastest time possible. What an incredible name for an activity. Not “running”, not “running fast”, but “speedrunning”. If you are not running fast, you are not doing the activity by definition. What divine beauty!</p>\n<p>The most important priority for any runner is to run fast. That goes for the ambulatory and digital varieties of running. I have learned much about speedrunning and it includes an important element of skill and a non-trivial amount of luck. It is also supported by an archive of glitches and exploits to make the game faster than originally intended. These things are not what is so interesting about speed running. It’s the speedrunners themselves.</p>\n<p>Speedrunners are usually lonely and nameless. Perhaps they participate with a few friends. Sometimes if they’re lucky, they get a following on Twitch. But for the vast majority of runners, it’s just them and the game. Many people say sinking countless hours into playing the same game the same way over and over again is a waste, but not for the speedrunner. You could say the same about any runner, but hypocritically the modern runner is sickeningly revered. Oh to have a culture so pure in motivation! I lament the accolades and popular affirmation heaped on people who run marathons and 5ks and the like. How hard it is to find and nurture a true love for speed in this age! These speed runners, they have it.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/78c0400abe3063d3586ff6137babcc5c/b80f6/run-fast-today.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 83.82978723404257%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAARABQDASIAAhEBAxEB/8QAGQABAQADAQAAAAAAAAAAAAAAAAMBAgQF/8QAFgEBAQEAAAAAAAAAAAAAAAAAAQIA/9oADAMBAAIQAxAAAAHzp7c5d0m1eYKwGf/EABwQAAAHAQEAAAAAAAAAAAAAAAABAgMRITMQI//aAAgBAQABBQJzZVBNk6fpIJcB3Tn/xAAVEQEBAAAAAAAAAAAAAAAAAAARIP/aAAgBAwEBPwEj/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAgEBPwEf/8QAHBAAAQQDAQAAAAAAAAAAAAAAAQAQIUECEXGR/9oACAEBAAY/AjO1AYwBSrxsuv8A/8QAGxAAAwEAAwEAAAAAAAAAAAAAAAERMRAhQaH/2gAIAQEAAT8hS+itSFaaP3p9GiF4yYlLkgMSJH3h8f/aAAwDAQACAAMAAAAQcwC8/8QAGBEAAgMAAAAAAAAAAAAAAAAAABEBEDH/2gAIAQMBAT8QYROV/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAEQESH/2gAIAQIBAT8Qs0Uf/8QAHhABAAIBBAMAAAAAAAAAAAAAAQARMSFBUXEgYZH/2gAIAQEAAT8QTagiNNeyuIhEoEIYdyhol7Wx1W3CBT7ieD5pf2AS0eHn/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"If you fail to run fast today, run fast today!\"\n        title=\"\"\n        src=\"/static/78c0400abe3063d3586ff6137babcc5c/f8fb9/run-fast-today.jpg\"\n        srcset=\"/static/78c0400abe3063d3586ff6137babcc5c/e8976/run-fast-today.jpg 148w,\n/static/78c0400abe3063d3586ff6137babcc5c/63df2/run-fast-today.jpg 295w,\n/static/78c0400abe3063d3586ff6137babcc5c/f8fb9/run-fast-today.jpg 590w,\n/static/78c0400abe3063d3586ff6137babcc5c/85e3d/run-fast-today.jpg 885w,\n/static/78c0400abe3063d3586ff6137babcc5c/b80f6/run-fast-today.jpg 940w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Speedrunners also have an enormous amount of what I call “mental toughness”. Imagine you’re running a marathon, you’re feeling great, and you hit a brick wall at mile 20. You’re devastated. So you pick yourself back up, you console yourself, and next time you take it easier. You run slower. Speedrunners afford themselves no such wimpiness. No, if you’re a speedrunner and you get burned by RNG 2 hours into a run, you slam that reset button and go again HARDER than you did before. You have no time to be a baby and whine as a speedrunner. You have frames to save!</p>\n<p>So what can we learn from the speedrunner? We must not fall victim to the running culture around us. If you’re only motivated to run because it is the popular thing to do you will never run fast. You will never grind the countless hours in training that you need to be your fastest self. Learn from the speedrunner: grinding his or her weird hobby, ignoring all reason and society. Speed is the most important thing.</p>\n<p>We must become mentally tough. If you fail to run fast today, run fast today! Learn from the speedrunner. Don’t let the fact that your body is telling you to quit, make you quit. Trying again tomorrow is not good enough. Try again today!</p>\n<p>If you too want to be inspired by speedrunners. I recommend <img src=\"https://www.twitch.tv/zant/\" alt=\"Zant\">.</p>","frontmatter":{"title":"Revelations for Runners from Speedrunning","date":"February 08, 2019"}}},"pageContext":{"slug":"/speedrunning/","previous":{"fields":{"slug":"/running-by-feel/"},"frontmatter":{"title":"Learning to Run by Feel"}},"next":null}}