{"data":{"site":{"siteMetadata":{"title":"Runfastus","author":"Runfastus"}},"markdownRemark":{"id":"a2c9deb9-0755-5739-b7be-a3e297d89eaf","excerpt":"In the beginning, there was the beginning and the destination. The runner ran from the beginning to the destination and the runner saw that the run was fast…","html":"<p>In the beginning, there was the beginning and the destination. The runner ran from the beginning to the destination and the runner saw that the run was fast. Then the watch was invented and it told the runner exactly how fast the journey was from the beginning to the destination. The runner saw this was good for seeing how fast today was compared to yesterday. Then there was the GPS. It told the runner precisely how far the journey was from beginning to the destination. The runner saw this was good for comparing the various journeys that a runner might embark on. The runner could see how fast a run in one place at one time compared to that in another place at another time. The runner could evaluate any run and know which was faster. These are tools for running and they are good.</p>\n<p>The modern runner, however, is not so much better off than the ancient running counterpart. The modern running landscape is fraught with the danger of becoming a slave to the machines that once gave power and knowledge. The modern runner is in danger of losing the ability to run by feel. That is, the ability to run from the beginning to the destination and see that the run was fast.</p>\n<p>Sometimes you go out for a run. You feel cold, stiff, heavy or sluggish. Maybe it gets better after a little while; maybe it doesn’t. Maybe you get a cramp or start to feel hungry. Maybe that nagging hip injury starts to act up or a case of the shin splints. Maybe you’re not quite over that cold and your respiratory system isn’t as clear as you’d like it to be. Maybe all of these things are happening, maybe none of them. From all these experiences you now have a decision.</p>\n<p>Are you going to take it easy? Find a pace and a gait that suits how your body is feeling. Try to relax in the run. Or maybe just go for something that’s as good as it’s going to get. Your body will keep talking to you. Keep listening. Sometimes it’s good to take it easy even when you’re feeling good just to hear what your body has to say.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/e63c9a27218d5c5bc1f3637c9c9a497d/b80f6/listen-feel-it.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 83.82978723404257%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAARABQDASIAAhEBAxEB/8QAGQABAAIDAAAAAAAAAAAAAAAAAAECAwQF/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQD/2gAMAwEAAhADEAAAAeGnPFkB1LEVE//EABsQAAICAwEAAAAAAAAAAAAAAAABAhIDETEy/9oACAEBAAEFAipBSrwjk0WTGLyf/8QAFhEAAwAAAAAAAAAAAAAAAAAAABAR/9oACAEDAQE/ASP/xAAWEQADAAAAAAAAAAAAAAAAAAAAEBH/2gAIAQIBAT8BK//EABkQAQACAwAAAAAAAAAAAAAAABABESExgf/aAAgBAQAGPwIxEO6On//EAB0QAAICAgMBAAAAAAAAAAAAAAERACFRYRAxQaH/2gAIAQEAAT8hVJ/I96gQ0TkQhAc+RU1CQ10E6Dlf/9oADAMBAAIAAwAAABAEyMP/xAAYEQACAwAAAAAAAAAAAAAAAAAAEBEhQf/aAAgBAwEBPxC8JP8A/8QAGBEAAgMAAAAAAAAAAAAAAAAAABEBEDH/2gAIAQIBAT8QYhGV/8QAHRAAAgMAAgMAAAAAAAAAAAAAAREAIUEQMXGRof/aAAgBAQABPxBCA09phIru+I7eBsBJgjLo2y+pQBDSpjrIYCx2EAOfceR//9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Listen. Do you feel it?\"\n        title=\"\"\n        src=\"/static/e63c9a27218d5c5bc1f3637c9c9a497d/f8fb9/listen-feel-it.jpg\"\n        srcset=\"/static/e63c9a27218d5c5bc1f3637c9c9a497d/e8976/listen-feel-it.jpg 148w,\n/static/e63c9a27218d5c5bc1f3637c9c9a497d/63df2/listen-feel-it.jpg 295w,\n/static/e63c9a27218d5c5bc1f3637c9c9a497d/f8fb9/listen-feel-it.jpg 590w,\n/static/e63c9a27218d5c5bc1f3637c9c9a497d/85e3d/listen-feel-it.jpg 885w,\n/static/e63c9a27218d5c5bc1f3637c9c9a497d/b80f6/listen-feel-it.jpg 940w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Are you going to go hard? Take stock of all the pain and discomfort and embrace it. Strengthen your stride and feel the structure of your gait get strong as you push your weight forward. Lean forward and get on your midsoles. Your body will keep talking to you. Keep listening. Not just the shouts of pain and protest, but the subtleties as well.</p>\n<p>Have you gotten part way through and changed your mind? If you were taking it easy, take stock of how much distance you have left. Then dig deep, pick a finish line and charge toward it with everything you got. If you were going hard, keep going until you’re sure you want to slow it down. You will surely regret it if you let up too early. Through all of it, your body will keep talking to you. Keep listening. Listening is running by feel.</p>","frontmatter":{"title":"Learning to Run by Feel","date":"February 05, 2019","guest_author":null}}},"pageContext":{"slug":"/running-by-feel/","previous":{"fields":{"slug":"/transcendence/"},"frontmatter":{"title":"Transcendence and Inspiration for Runners of Every Kind"}},"next":{"fields":{"slug":"/speedrunning/"},"frontmatter":{"title":"Revelations for Runners from Speedrunning"}}}}