{"data":{"site":{"siteMetadata":{"title":"Runfastus","author":"Kyle Mathews"}},"markdownRemark":{"id":"1ea7a21b-becd-5d33-b0df-cb4f62041262","excerpt":"Biomechanics sounds like an intimidating concept. Like something you need a degree or two to really understand. But it really isn’t all that mysterious…","html":"<p>Biomechanics sounds like an intimidating concept. Like something you need a degree or two to really understand. But it really isn’t all that mysterious. Everyone already knows some biomechanics. If you jump off a balcony and land feet first, you’re probably well aware that you’ll break an ankle or a leg. Look you’re a natural! We don’t need to be doctors, we just want to know enough to run fast. If we’re going to run fast we have to learn to think for ourselves and not just go off of conventional or trend-based wisdom. So let’s talk about something every runner should have an opinion about, your stride.</p>\n<p>If you’re going to live on the edge between injury and speed you should know what different kinds of strides are doing for you. It’s plainly obvious (I hope) that the fastest way to run is on your toes. You get maximum power from your calves that way. Try running that way for 10 miles, however, and you’re likely to end up with some kind of injury.</p>\n<p>You might think that in order to prevent injury you should run with more of your foot on the ground and in fact you would be right in saying that would prevent a calf for ankle injury. It could be good or bad for your feet, but I’ll leave that as a puzzle for you to think about. But now you’d be dealing with a different issue. You see, preventing injury in a running stride is all about you that force gets distributed to the various joints in your body. Your body is like a spring. The more coils in an otherwise identical spring, the more distributed the force is and the less likely it is permanently deform or fail. The same principle applies to your body.</p>\n<p>I like to think of the body has having a few different coils: feet, ankles, knees, hips, and back. Perhaps there are more. Decide for yourself. So when your foot strikes the ground the force first goes into your foot and then gets transferred into your ankle, then to your knees, then to your hip, and finally to your back. The more each of those stages flex, the less force it will transfer to the next stage. So if you run on your toes, your foot and ankle can absorb that much more force and pass less to your knees and hips and back. Now you know why sprinters run on their toes; they have the maximum amount of force to deal with!</p>\n<p>So what if you run in trainers and strike the ground with your heel? In that case you’re essentially taking the ankle and foot out of the equation. All the force from the impact travels through those joints straight into your knees.</p>\n<p>This isn’t necessarily a bad thing and doesn’t mean you should always run on your midsoles (a happy balance between heel striking and running on your toes, my personal favorite stride and the most popular trend right now (although prescribing a stride to runners is going out of style)). What you should do with this knowledge is use it to your advantage and choose when to use what stride. If your ankles are hurting, go ahead and heel strike for a while. If your having issues with your back then try getting on your toes more. Learn about your body, experiment with it, and run fast.</p>","frontmatter":{"title":"Biomechanics","date":"January 18, 2019"}}},"pageContext":{"slug":"/biomechanics/","previous":{"fields":{"slug":"/treadmills/"},"frontmatter":{"title":"Treadmills"}},"next":null}}