{"data":{"site":{"siteMetadata":{"title":"Runfastus","author":"Runfastus"}},"markdownRemark":{"id":"06f03cd9-fad0-58cf-9503-9998ae675b79","excerpt":"We’ve been fed lies and separated from our previous culture. One where food was scarce and we woke up, killed, and ate.  We’ve been disconnected from the source…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/d1cc6e2ac403236e44a8b48b2d46604c/30631/caveman.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 66.6875%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAQFAQL/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAGwqtp0Tg//xAAbEAABBQEBAAAAAAAAAAAAAAABAAIDBBESIf/aAAgBAQABBQJxVg8IeNjsarJxplfn/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAHxAAAQMDBQAAAAAAAAAAAAAAAAERIQIxgRITIkFR/9oACAEBAAY/ApHtAjvk0rTk3G52RfBJ6P/EABoQAQADAQEBAAAAAAAAAAAAAAEAETEhQYH/2gAIAQEAAT8hodPIF7U9VbD00pcNQNtaYO56HPiA1ul6s//aAAwDAQACAAMAAAAQGx//xAAXEQEAAwAAAAAAAAAAAAAAAAAAAREh/9oACAEDAQE/EJxb/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAHBABAQADAQEBAQAAAAAAAAAAAREAITFBYVFx/9oACAEBAAE/EBjEDQptZ58zSERRt2HemFEFoRb88wdS6RJmzXfP3Lr7wv6HGHtwdYrtXP/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Caveman\"\n        title=\"\"\n        src=\"/static/d1cc6e2ac403236e44a8b48b2d46604c/f8fb9/caveman.jpg\"\n        srcset=\"/static/d1cc6e2ac403236e44a8b48b2d46604c/e8976/caveman.jpg 148w,\n/static/d1cc6e2ac403236e44a8b48b2d46604c/63df2/caveman.jpg 295w,\n/static/d1cc6e2ac403236e44a8b48b2d46604c/f8fb9/caveman.jpg 590w,\n/static/d1cc6e2ac403236e44a8b48b2d46604c/85e3d/caveman.jpg 885w,\n/static/d1cc6e2ac403236e44a8b48b2d46604c/d1924/caveman.jpg 1180w,\n/static/d1cc6e2ac403236e44a8b48b2d46604c/30631/caveman.jpg 1600w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>We’ve been fed lies and separated from our previous culture. One where food was scarce and we woke up, killed, and ate.  We’ve been disconnected from the source of our life-giving substance. We live in a time where carbohydrates are available all day/year long and what’s worse is that these are highly processed and void of nutrients. With this separation has also come the ignorance of what to eat and why and most importantly what diet is optimal.</p>\n<p>To figure this out it’s important to look back at our evolutionary history.  We came down from the trees where we chewed on leaves all day to extract the amount of protein we would need to survive as our massive guts (think gorillas) fermented all this plant matter and created the short chain fatty acids we needed to survive. We eventually evolved and walked upright as we came upon carcasses left over from a lion kill and we started eating the marrow left over in the bone. And with the advent of fire perhaps we scared off predators from their recent kill and then took it for ourselves.  However we did it, what we know is that we eventually hunted and cooked our food and we selected the fattest animals we could find like the woolly mammoth or the buffalo. In order for our brains to grow, our guts had to shrink in what is referred to by archaeologists as the expensive tissue hypothesis.   Our brains require massive amounts of energy in order to function properly and this would not be possible without eating fatty meat. It would also not be possible with a gut as big as gorillas so our guts had to shrink and now resemble something closer to a wolf than a chimp or gorilla.  </p>\n<p>Fat is our oldest friend and not a foe like one that has been purported by the media in most articles about nutrition.  One of the earliest hunting strategies used by humans is known as persistence hunting. Some tribes still use this form of tracking and hunting where they run down their prey till exhaustion.  We are able to do this because of our sweat glands and little body hair which enables us to cool down where other animals overheat. The other reason for this is our ability to burn fat for fuel, these hunters did not have sugar filled packs of “GU” while running long distances, so how did they do it? The answer lies in the magical power of something called a ketone.  Ketones or ketone bodies are produced by the liver through the metabolism of fat in a process called ketogenesis. This process creates energy that can sustain someone in the event of fasting, carbohydrate restriction, or in prolonged physical activity.  This is something our body is programmed and evolved to do in order to keep us alive.  In modern society those three situations hardly ever happen, so we’ve become a shell of our former selves from a biological perspective.  But this power is still accessible to anyone willing to train their body to perform at its best.  Many athletes have discovered the power of ketones and are setting records around the world. Victory and speed are within your grasp if you would only choose to adapt and begin again.  This will bring new meaning to the ancient quotation from the Bible (Psalm 23:5) “My cup runneth over” meaning you have more than enough for your needs, and indeed you do… within your fat cells.</p>","frontmatter":{"title":"My Cup Runneth Over - Ketogenesis","date":"February 16, 2019"}}},"pageContext":{"slug":"/nutrition-1/","previous":{"fields":{"slug":"/power-v-speed/"},"frontmatter":{"title":"Running Power vs. Running Speed"}},"next":null}}