{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"d41b1f58-2ae5-5e29-a8cf-777b4eac1f81","excerpt":"Running shoes are a wealth of interest for a runner. As I’ve matured in the sport, I’ve expanded my arsenal of running shoes to be prepared to run in every…","html":"<p>Running shoes are a wealth of interest for a runner. As I’ve matured in the sport, I’ve expanded my arsenal of running shoes to be prepared to run in every situation. These are my meditations on running shoes.</p>\n<p>My philosophy: Choosing running shoe is about teetering on the edge of speed and injury.</p>\n<p>Trainers: They’re designed to keep you from getting injured (as far as I can tell). They’re bulky, they have a huge drop restricting the power generated by your calves, and tend to be inflexible as well. I only run in these when I’m injured in my ankle or foot because they’re slow and boring.</p>\n<p>Low Drop Trainers: These tend to be my preferred running shoe. They make it easy to strike with the midsole or otherwise take the impact into some part of the forefoot. This is important because it allows you to take your impact into your ankle instead of just your knee and you hip. For this reason these are actually the ideal shoe to keep from getting injured. You can also get more power and run faster than you can in trainers. Altra brand running shoes are zero drop which is really great but they can be really tough on your calves if you’re not careful. The Brooks Pure Running series helped me ease into them.</p>\n<p>Performance Flats: I use these when I want to run fast on roads. They are the minimal amount of shoe you need to keep your skin off the pavement. I love these shoes, but I can’t help but feel guilty for crushing my joints on the pavement with no cushioning.</p>\n<p>Spikes: I only use these on the track. Obviously the spikes give traction, but some have a more interesting feature. They have a negative drop. Yes the toe has more shoe under it than the ankle. This really gets you on your toes and you can really fly. It’s thrilling.</p>\n<p>Barefoot: Barefoot running is not fast and gets you injured. I have no reason to ever run barefoot.</p>\n<p>There are a lot more kinds of shoes out there like trail shoes, sandals, Vibrams, Nike Free series shoes, etc. I haven’t tried any of them so I can’t comment, but given their commercial success, I imagine choosing a running shoe is much deeper than I know</p>","frontmatter":{"title":"Tools For Running","date":"January 16, 2019"}}},"pageContext":{"slug":"/tools-for-running/","previous":null,"next":null}}