{"data":{"site":{"siteMetadata":{"title":"Runfastus","author":"Runfastus"}},"markdownRemark":{"id":"846c3d27-22bc-51a5-a6c1-40dad06f8e22","excerpt":"This week I achieved a major running goal for myself.  I ran 10 miles per day for seven days straight. A whole 70 miles in one week. This is 15 miles more than…","html":"<p>This week I achieved a major running goal for myself.  I ran 10 miles per day for seven days straight. A whole 70 miles in one week. This is 15 miles more than my previous top weekly mileage. I experienced great fatigue. I felt the effects of overtraining. It was not just hard during the course of the activity, but it put also strain on my entire life. Now it is done and I have given myself four days off. My next goal is to casually run a marathon, but seeing as it is February and I have many months to achieve this goal I am tempted to continues to rest.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/eace81dfdf7515929a2386a1d7ffc60e/a0e60/trueness-of-running.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMC/8QAFgEBAQEAAAAAAAAAAAAAAAAAAAEC/9oADAMBAAIQAxAAAAHE5wmNtCeRajM//8QAGRAAAwEBAQAAAAAAAAAAAAAAAAECETEy/9oACAEBAAEFAkkVklJt6VWtC8zw/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAwEBPwEf/8QAFREBAQAAAAAAAAAAAAAAAAAAASD/2gAIAQIBAT8BI//EABcQAQADAAAAAAAAAAAAAAAAABABICH/2gAIAQEABj8CMpL/AP/EABsQAQACAwEBAAAAAAAAAAAAAAEAESExQRBR/9oACAEBAAE/IV53LhVCsSvUSHZQbxL12KwftwDkef/aAAwDAQACAAMAAAAQy88+/8QAFhEAAwAAAAAAAAAAAAAAAAAAABAR/9oACAEDAQE/ECv/xAAYEQEBAAMAAAAAAAAAAAAAAAABABARIf/aAAgBAgEBPxBK9ldzj//EABwQAQADAAIDAAAAAAAAAAAAAAEAESExQVFhkf/aAAgBAQABPxDtJecu35HSSWPR6KlOSau+YIRHluFXaBNhvyl5nUcwZtW8QEgtpLQoWf/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Go and experience your earned trueness of running.\"\n        title=\"\"\n        src=\"/static/eace81dfdf7515929a2386a1d7ffc60e/f8fb9/trueness-of-running.jpg\"\n        srcset=\"/static/eace81dfdf7515929a2386a1d7ffc60e/e8976/trueness-of-running.jpg 148w,\n/static/eace81dfdf7515929a2386a1d7ffc60e/63df2/trueness-of-running.jpg 295w,\n/static/eace81dfdf7515929a2386a1d7ffc60e/f8fb9/trueness-of-running.jpg 590w,\n/static/eace81dfdf7515929a2386a1d7ffc60e/a0e60/trueness-of-running.jpg 800w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>We’ve all been there. You’re training super hard, you get out there, you achieve your goal and you give yourself a rest as a reward. Once you’ve rested you wonder about getting back out there. Something in you just wants one more day of rest. You must run fast, but why does it have to be today?</p>\n<p>You must recognize the insipid nature of the running culture around you. That with your achievement and your inevitable bragging on social media you have not rewarded yourself, you have actually drugged yourself. You haven’t been resting, you have been in a semi-conscious high fueled by social media and braggadocio. You’ve been drugged and you must take yourself off of the course you have put yourself on.</p>\n<p>No, you have not achieved some great fitness goal. You have not reached a podium of personal fitness success on which you now stand. Absolutely not. You must recognize that once you have achieved your goal, especially if you have never achieved such a high degree of fitness before, that you are now a faster runner than you have ever been in your life. Your reward is not a social media victory parade. Your reward lies in getting out there and running with a strength, power, and speed with which you’ve never run before. You’ve reached proximity with the trueness of the running experience that you have never reached before. Go experience it!</p>\n<p>Here is my recommendation. Rest and recover. Three or four days if you must. This will give your body time to heal from any symptoms of overtraining. These include headaches, general feelings stress, strange pains or fragility in your joints, as well as catching colds or an otherwise weakened immune system. But don’t revel in the rest, look forward to your first day back. When you do get back, give yourself plenty of time and plenty of distance to run. Make your body comfortable. Turn off the GPS, turn off the watch and just run. Let your body tell you what it wants to do. Let your body show you what it’s capable of. Give your body control and it will show you its true speed.</p>\n<p>After this, pick your next goal and start working on it. You trained so hard to make your body faster. Take advantage of it.</p>","frontmatter":{"title":"Recovery from Achieving Your Running Goals","date":"February 18, 2019","guest_author":null,"tags":null}}},"pageContext":{"slug":"/goal-recovery/","previous":{"fields":{"slug":"/nutrition-1/"},"frontmatter":{"title":"My Cup Runneth Over - Ketogenesis"}},"next":{"fields":{"slug":"/mental-toughness/"},"frontmatter":{"title":"Mental Toughness in Runners"}}}}